// <!-- html 주석 -->
// /* css 주석 */

//! js 주석
// : 주석 단축키 ctrl + /
// 여러 줄 주석
/*
여러 줄 주석은 슬래시 사이에 별표를 사용
*/

//! 자바스크립트 소개

// html: 웹 콘텐츠를 구성하는 마크업 언어
// css: HTML 콘텐츠에 스타일을 적용하는 스타일 규칙 언어
// js: 서버나 웹에서 작동하는 프로그램을 만드는 프로그래밍 언어

//! 자바스크립트 활용

// 1. 웹 클라이언트 애플리케이션 개발 (프론트엔드 개발)
// : 사용자가 웹 요소를 제어하는 웹 사이트의 UI 부분에 활용

// 2. 웹 서버 애플리케이션 개발 (백엔드 개발)
// : node.js로 자바스크립트를 활용하여 서버 개발 가능

// 3. 모바일 애플리케이션 개발 (프론트엔드 개발)
// 안드로이드: 자바, 코틀린(백엔드)
// 아이폰: 스위프트(백엔드)
// 리액트 네이티브를 활용하여 모바일 운영체제의 프론트엔드 개발 가능

//! 자바스크립트의 버전
// ECMAScript 표준 - JS의 새로운 기능과 동작 정의
// ECMAScript 2015 (ES6)
// ESNext: ES6 이후에 계속 업데이트 되고 있는 버전

//! 자바스크립트의 특징
// 1. 동적 언어
// : JS가 실행되는 시점에서 해석되는 언어
// 2. 객체 기반
// : 객체를 사용하여 데이터와 함수를 묶을 수 있는 언어
// 3. 이벤트 기반
// : 사용자의 행동(클릭, 키보드 입력, 마우스 이동 등)에 따라 코드가 실행